{"appointmentDetails":{"appointmentTypeInfo":[{"ap_id":1253176,"ap_apptname":"RX  abdomen","ap_resourcename":"Room 1","prep_text":"An abdominal x-ray is an imaging test to look at organs and structures in the abdomen. Organs include the spleen, stomach, and intestines.<p><\/p><font color='blue'>How the Test is Performed:<\/font> <p><\/p>The test is done in a hospital radiology department. Or, it may be done in the health care provider's office by an x-ray technologist.<p><\/p>You lie on your back on the x-ray table. The x-ray machine is positioned over your abdominal area. You hold your breath as the picture is taken so that the picture will not be blurry. You may be asked to change position to the side or to stand up for additional pictures.<p><\/p>Men will have a lead shield placed over the testes to protect against the radiation.<p><\/p><font color='blue'>How to Prepare for the Test<\/font> <p><\/p>Before having the x-ray, tell your provider the following:<p><\/p>•If you are pregnant or think you could be pregnant<p><\/p>•Have an IUD inserted<p><\/p>•Have had a barium contrast x-ray in the last 4 days<p><\/p>•If you have taken any medicines such as Pepto Bismol in the last 4 days (this type of medicine can interfere with the x-ray) <p><\/p>You wear a hospital gown during the x-ray procedure. You must remove all jewelry.<p><\/p><font color='blue'>How the Test will Feel<\/font> <p><\/p>There is no discomfort. The x-rays are taken as you lie on your back, side, and while standing.<p><\/p>","appt_time":"2017-08-31 09:20:00.0","dpt_name":"Medical Imaging"},{"ap_id":1253177,"ap_apptname":"CT  abdomen","ap_resourcename":"Scan CT ","prep_text":"Abdominal ultrasound is a type of imaging test. It is used to look at organs in the abdomen, including the liver, gallbladder, spleen, pancreas, and kidneys. The blood vessels that lead to some of these organs, such as the inferior vena cava and aorta, can also be examined with ultrasound.<p><\/p><font color='blue'>How the Test is Performed<\/font> <p><\/p>An ultrasound machine makes images of organs and structures inside the body. The machine sends out high-frequency sound waves that reflect off body structures. A computer receives these waves and uses them to create a picture. Unlike with x-rays or CT scans, this test does not expose you to ionizing radiation. <p><\/p>You will be lying down for the procedure. A clear, water-based conducting gel is applied to the skin over the abdomen. This helps with the transmission of the sound waves. A handheld probe called a transducer is then moved over the abdomen.<p><\/p>You may need to change position so that the health care provider can look at different areas. You may also need to hold your breath for short periods during the exam.<p><\/p>Most of the time, the test takes less than 30 minutes.<p><\/p><font color='blue'>How to Prepare for the Test<\/font> <p><\/p>How you will prepare for the test depends on the problem. You will likely be asked not to eat or drink for several hours before the exam. Your provider will go over what you need to do. <p><\/p><font color='blue'>How the Test will Feel<\/font> <p><\/p>There is little discomfort. The conducting gel may feel a little cold and wet.<p><\/p><font color='blue'>Why the Test is Performed<\/font> <p><\/p>You may have this test to: <p><\/p>•Find the cause of abdominal pain<p><\/p>•Find the cause of kidney infections<p><\/p>•Diagnose and monitor tumors and cancers<p><\/p>•Diagnose or treat ascites<p><\/p>•Learn why there is swelling of an abdominal organ<p><\/p>•Look for damage after an injury<p><\/p>•Look for stones in the gallbladder or kidney<p><\/p>•Look for the cause of abnormal blood tests such as liver function tests or kidney tests<p><\/p>•Look for the cause of a fever <p><\/p>The reason for the test will depend on your symptoms.<p><\/p>","appt_time":"2017-08-31 10:25:00.0","dpt_name":"Medical Imaging"},{"ap_id":1253178,"ap_apptname":"First Appointment","ap_resourcename":"Mary Smith","prep_text":"","appt_time":"2017-09-18 09:15:00.0","dpt_name":"Gastroenterology"},{"ap_id":1253179,"ap_apptname":"Endoscopy","ap_resourcename":"Mary Smith","prep_text":"Endoscopy involves the use of a flexible video instrument (gastroscope) to examine the upper intestinal tract including the oesophagus, stomach and duodenum. The procedure is commonly undertaken if your Doctor suspects that you have inflammation, ulceration or other abnormality of the oesophagus, stomach or duodenum.<p><\/p><font color='blue'>Preparation<\/font><p><\/p>* No alcohol to be consumed and stop smoking 12 hours before your procedure<p><\/p>* Cease solid food for six (6) hours before your procedure<p><\/p>* Drink water - 1 glass per hour until 2 hours before your procedure<p><\/p>* Nothing further to drink until after your procedure<p><\/p>While fasting take all regular medication with a sip of water at least three hours prior to procedure.<p><\/p>If you have serious heart or chest problems or drug allergies, special precautions need to be taken to reduce any risk. You should therefore inform the doctor of any serious conditions of this nature.<p><\/p>If you are diabetic, withhold your morning medication and bring it and a sandwich with you to take following the procedure.<p><\/p>At the beginning of the procedure you will be given a sedative by injection into a vein to make you comfortable and relaxed. The procedure will take between 5 – 15 minutes and you will be sleepy for about half an hour afterwards.<p><\/p><font color='blue'>What will be done<\/font><p><\/p>An endoscope is a flexible tube about 9mm (3/8') in diameter. It allows full colour inspection of the oesophagus, stomach and duodenum. It also enables biopsies to be taken from these areas if necessary.<p><\/p>You will be given time to recover from your procedure in an observed recovery area, followed by light refreshments.<p><\/p>The doctor will then talk with you and discuss any findings. You will be given written information and the necessary follow up. A detailed report will be sent to your G.P.<p><\/p><font color='red'>For legal reasons you must not drive a vehicle or operate machinery for at least 12 hours following sedation. Driving under the influence of sedation carries the same implications as with alcohol. You should have a responsible adult with you to drive you home and stay with you for twelve hours.<\/font>","appt_time":"2017-10-09 14:15:00.0","dpt_name":"Gastroenterology"}],"xmlns:appointmentdetails":"http://com.bf.viaduct/getAppointmentDetails/appointmentDetails.dbecore"}}
